In [ ]:
#!pip install PyMySQL

In [1]:
import pymysql
import pandas.io.sql as psql
import pandas as pd

In [2]:
with pymysql.connect(database='webmarket', 
                     host='localhost', 
                     port=3306, 
                     user='root', 
                     password='####') as conn:
  sql = """SELECT
            purchase_id,
            amount,
            coupon,
            amount - coupon AS discount_amount1,
            amount - COALESCE(coupon, 0) AS discount_amount2
            FROM purchase_log_with_coupon
            """
  df_now = psql.read_sql(sql, conn)

df_now

/var/folders/l5/366nz8fs75gdr134874nc3nc0000gn/T/ipykernel_5922/2785162279.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_now = psql.read_sql(sql, conn)

  purchase_id  amount  coupon  discount_amount1  discount_amount2
0       10001    3280     NaN               NaN              3280
1       10002    4650   500.0            4150.0              4150
2       10003    3870     NaN               NaN              3870

In [4]:
with pymysql.connect(database='webmarket', 
                     host='localhost', 
                     port=3306, 
                     user='root', 
                     password='####') as conn:
    sql = "SELECT * FROM purchase_log_with_coupon"
    df_coupon = psql.read_sql(sql, conn)
    
df_coupon

/var/folders/l5/366nz8fs75gdr134874nc3nc0000gn/T/ipykernel_5922/2096827969.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_coupon = psql.read_sql(sql, conn)

  purchase_id  amount  coupon
0       10001    3280     NaN
1       10002    4650   500.0
2       10003    3870     NaN

In [5]:
df_coupon['discount_amount1'] = df_coupon['amount'] - df_coupon['coupon']
df_coupon['discount_amount2'] = df_coupon['amount'].sub(df_coupon['coupon'], 
                                                        fill_value=0)
df_coupon

  purchase_id  amount  coupon  discount_amount1  discount_amount2
0       10001    3280     NaN               NaN            3280.0
1       10002    4650   500.0            4150.0            4150.0
2       10003    3870     NaN               NaN            3870.0